/**
 * Масиви
 *
 * - Створення масиву
 * - Доступ до елементів
 * - Перевизначення значення елемента
 * - Довжина масиву
 * - Індекс останнього елемента
 * - Перевизначення
 */
//!======================================================
// const users = ['Vasya', 'Kolya', 'Petya'];

// console.log(users[0]);
// console.log(users[1]);
// console.log(users[2]);

// users[0] = 'Anton';

// console.log(users);

//!======================================================

// const prices = [100, 200, 300, 400, 500];

// prices[0] += 50;

// console.table(prices);

//!======================================================

// const array = [10, 20, 40, 60, 4, 1, 24, 5];

// console.log(array.length);

// console.log(array[array.length - 1]);

//!======================================================
