/**
 * Передача за посиланням і за значенням
 *
 * Примітиви і складні типи
 * Посилальна рівність (referential equality)
 */

// const arr = [10, 20, 30];
//!======================================================
// const x = ['1.pdf', '2.pdf', '3.pdf'];
// const y = x;

// y[0] = 'newFile.pdf';

// console.log(x);
// console.log(y);

// console.log(x === y);

//!======================================================

// const x = [1, 2, 3];
// const y = [1, 2, 3];
// console.log(x === y);

//!======================================================
